## Pandas

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## 1 Introduction to pandas Data Structures

### 1.1 Seris

In [3]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2['a']

-5

In [8]:
obj2['d'] = 5
obj2

d    5
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [10]:
obj2[obj2 > 0]

d    5
b    7
c    3
dtype: int64

In [11]:
obj2 * 2

d    10
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d     148.413159
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
'c' in obj2

True

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': np.NaN}
obj3 = Series(sdata)
obj3

Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah          NaN
dtype: float64

In [17]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index= states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [410]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [411]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [412]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [413]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

### 1.2 DataFrame

In [414]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [415]:
obj = Series(data)

In [416]:
obj

pop               [1.5, 1.7, 3.6, 2.4, 2.9]
state    [Ohio, Ohio, Ohio, Nevada, Nevada]
year         [2000, 2001, 2002, 2001, 2002]
dtype: object

In [417]:
frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [418]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [419]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])

In [420]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [421]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: pop, dtype: float64

In [422]:
frame2.year + 1

one      2001
two      2002
three    2003
four     2002
five     2003
Name: year, dtype: int64

In [426]:
frame2.loc[['three','five']]

       year   state  pop debt
three  2002    Ohio  3.6  NaN
five   2002  Nevada  2.9  NaN

In [424]:
frame2.iloc[2:4,:]

       year   state  pop debt
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN

In [427]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [428]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [429]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [430]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [ ]:
del frame2['eastern']
frame2

In [431]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [432]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [433]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

## 2 Essential Functionality

### 2.1 Reindexing

In [434]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [435]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [436]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [437]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [439]:
obj3.reindex(range(6), method='bfill') #bfill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [440]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [441]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'], method ='ffill')
frame2

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

### 2.2 Dropping entries from an axis

In [4]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [5]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [6]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [7]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### 2.3 Indexing, selection, and filtering

In [9]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [10]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [11]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [12]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [13]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [14]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [15]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [16]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [18]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
data.ix['Colorado', ['two', 'three']]

/Users/dwang35/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int64

In [458]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [462]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [463]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [464]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### 2.4 Arithmetic and data alignment

In [465]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [466]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [467]:
s1.add(s2, fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

### 2.5 Function application and mapping

In [468]:
frame = DataFrame(np.random.randn(4, 3), 
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [469]:
frame

               b         d         e
Utah    0.528511  0.887539  1.237935
Ohio    1.480162  0.483584  0.646472
Texas   0.544011  1.763827 -0.158677
Oregon  1.669915  2.315340 -2.277564

In [ ]:
np.abs(frame)

In [470]:
f = lambda x: np.abs(x).max() - np.abs(x).min()

In [471]:
frame.apply(f)

b    1.141404
d    1.831757
e    2.118887
dtype: float64

In [472]:
frame.apply(f, axis=1)

Utah      0.709424
Ohio      0.996579
Texas     1.605150
Oregon    0.645425
dtype: float64

In [473]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min  0.528511  0.483584 -2.277564
max  1.669915  2.315340  1.237935

### 2.5 Sorting and ranking

In [474]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [475]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [476]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [477]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [478]:
frame.sort_index(1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [479]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [480]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [481]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [482]:
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

### Correlation and Covariance

In [483]:
ret = DataFrame(np.random.rand(400).reshape((100, 4)),columns=['AAPL', 'GD', 'IBM', 'MSFT'])
ret.head()

       AAPL        GD       IBM      MSFT
0  0.608696  0.004281  0.608591  0.974144
1  0.218661  0.719206  0.457283  0.354638
2  0.132641  0.572133  0.841521  0.993858
3  0.285944  0.127639  0.908955  0.553524
4  0.787641  0.713624  0.762916  0.452814

In [484]:
ret.corr()

          AAPL        GD       IBM      MSFT
AAPL  1.000000 -0.056053 -0.111225 -0.019030
GD   -0.056053  1.000000 -0.030535 -0.059579
IBM  -0.111225 -0.030535  1.000000 -0.012412
MSFT -0.019030 -0.059579 -0.012412  1.000000

In [485]:
ret.cov()

          AAPL        GD       IBM      MSFT
AAPL  0.083936 -0.005104 -0.008622 -0.001698
GD   -0.005104  0.098781 -0.002568 -0.005766
IBM  -0.008622 -0.002568  0.071598 -0.001023
MSFT -0.001698 -0.005766 -0.001023  0.094808

## Deal with missing data

In [486]:
from numpy import nan as NA

In [487]:
data = DataFrame([[1., 6.5, 4.], [1., NA, NA],
.....: [NA, NA, NA], [NA, 6, 9.]])
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  9.0

In [488]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  4.0

In [489]:
data.fillna(0)

     0    1    2
0  1.0  6.5  4.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.0  9.0

In [490]:
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  9.0

In [491]:
data.fillna(method='ffill')

     0    1    2
0  1.0  6.5  4.0
1  1.0  6.5  4.0
2  1.0  6.5  4.0
3  1.0  6.0  9.0

In [492]:
data.fillna(data.mean())

     0     1    2
0  1.0  6.50  4.0
1  1.0  6.25  6.5
2  1.0  6.25  6.5
3  1.0  6.00  9.0

In [493]:
s = pd.Series([0, 1, np.nan, 3])
s

0    0.0
1    1.0
2    NaN
3    3.0
dtype: float64

In [494]:
s.interpolate()

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64